{
	"PreviousNewsListContent": [
		{
			"title": "PreviousNews",
			"introTitle": "Health Care In The News",
			"previousNews": [
                {"previousNews": "<p><b>An owner-operated nursing service in New York City, Jill Tucker Nursing Services provides private nurses and licensed professionals for patients and offices in New York City and Washington DC.</b></p>"},
                {"previousNews": "<p/><b>Jill Tucker, RN says: </b>&#8220;Internet technology continues to grow as an important tool in health care innovation and great rewards are promised for the future. <b>But a human mind is still required to interpret and prioritize data, and the human touch is still important in the patient recovery process.</b> The nurses at Jill Tucker Nursing Services are trained in the latest technology and also have years of experience working closely and intimately with patients and their families. Arrange for nursing coverage in the home, hospital or hotel with Jill Tucker and be guaranteed thoughtful insight and hands-on care that will optimize the recovery process.&#8221;<br><a href='http://www.healthcareitnews.com/news/national-health-it-week-2016-what-expect' target='_blank'><i><b>National Health IT Week 2016 kicks off Monday</b></i></a><br>HealthcareITnews.com  September 20, 2016<p/>"},
								{"previousNews": "<p>&#8220;Teamwork among health care professionals assures quality of care and helps reduce recovery time. Jill Tucker Nursing Services assigns nurses who have previously worked together to provide 24-hour and/or long-term team care to private clients. Nurses skilled in orthopedic surgery recovery, plastic surgery recovery or home companion care come together to provide continuous and seamless care. The nurses are experts in their field, the communication is clear, and the team acts as one to assure the full and rapid recovery of the patient.&#8221;<br/><a href='http://www.merinews.com/article/successful-organizations-emphasize-and-promote-teamwork/15918456.shtml' target='_blank'><i> <b>Successful Organizations Emphasize and Promote Teamwork</b></i></a><br>Merinews.com  August 4, 2016<br/>"},
								{"previousNews": "<p><b>&#8220;Recent studies show that cardiac care patients benefit greatly from having home private nursing care in the days immediately after release from the hospital.</b> The combination of a visit to the doctor and multiple home nursing visits in the week following discharge reduced the probability of readmission (for heart failure patients) by roughly eight percentage points.&#8221;<br/><a href='http://www.healthleadersmedia.com/quality/front-loaded-home-care-and-office-visits-may-reduce-heart-failure-readmissions?page=0%2C1' target='_blank'><i> <b>Front-loaded Home Care and Office Visits May Reduce Heart Failure Readmissions</b></i></a><br>Healthleadersmedia.com  August 11, 2016 <br/>"},
								{"previousNews": "<p>&#8220;Patients often travel to the United States from their home countries to receive the best surgical treatment and premier post-surgical nursing care. Jill Tucker Nursing is proud to feature a number of <b>health care professionals who are either bilingual or adept in multiple languages.</b> Communicating with patients allows for greater attention to detail in nursing care and recovery, and understanding the culture and background of the patient creates a more comfortable and healing environment.&#8221;<br/><a href='https://www.linkedin.com/pulse/5-benefits-hiring-bilingual-employee-nathalie-jansen' target='_blank'><i> <b>Benefits of Hiring a Bilingual Employee</b></i></a><br> LinkedIn.com  September 3, 2015<br/><br/>"}
            ]
		}
	]
}
