{
	"TestimonialsListContent": [
		{
			"title": "Testimonials",
			"introTitle": "Testimonials From Patients and Clients",
			"testimonials": [
                {"testimonial": "<p>&#8220;I recently had to travel alone to NYC to undergo a surgical procedure that required aftercare. Not having my spouse or any family available to assist me, my doctor recommended Jill Tucker Nursing Services.</p>
								<p>After I contacted other agencies for comparison purposes, it became immediately clear after speaking with Jill that her company was the right choice. Jill took the time to ask me about my care, health conditions, concerns, and got to know me as a person to ensure she placed me with the proper nurse. After my first 24 hours, I was able to transition from an RN to a nursing assistant who also accompanied me to my follow up visit two days later.</p> <p>After going through this process, I can’t stress enough how important it is you consider securing an RN from Jill Tucker for aftercare, with or without family to take care of you. It was invaluable to have an RN with me during those first 24 hours of care, who met me at the doctor’s office, and accompanied me back to my hotel while I was still groggy and somewhat out of it. The things that an RN knows how to do as a trained professional such as managing the medications, changing dressings, cleaning wound areas, monitoring blood pressure and temperature, while keeping a constant eye on you during the transition from surgery to wellness is worth every penny. I am glad now to not have burdened my spouse with these things that really require a special aptitude and skillset. This was the best decision I could have made and you’ll thank yourself later for doing the same.    I should mention Jill also followed up with me three days later to be sure I was doing ok. That’s the type of care and concern she shows toward her patients. I can’t recommend Jill Tucker Services highly enough for anyone seeking for top shelf nursing services.&#8221;</p></p>", "patientFrom": "<b>G.J., Philadelphia, PA</b>"},
                {"testimonial": "<p>&#8220;<p>“I have a husband, two small children and a busy home life in Boston, and when I needed to stay overnight for a surgical procedure in New York, Jill's nursing services provided the required 24-hour aftercare. I knew that having my husband at home with the kids would provide the least disruption to their daily lives, but needed someone to stay overnight with me until the 24-hour post-procedure &#8220;danger&#8221; period had passed. My plastic surgeon’s office recommended Jill's nursing services, having worked with her for seven years to rave reviews. When I called Jill, she and I came up with a great plan and within a day she matched me up with a wonderful nurses' assistant. The nurses' assistant was extremely helpful but at the same time very sensitive to giving me space—just the right balance. Jill herself was friendly, funny, and extremely easy to work with. She arranged everything so I didn't have to worry, stayed in contact with my doctor's office during the day of my procedure while I was under anesthesia so my family and I had peace of mind, called my family to give them an update, and checked in afterward with me as well. I can't recommend her services more highly!</p>&#8221;</p></p>", "patientFrom": "<b>C.C., Boston, MA</b>"},
								{"testimonial": "<p>&#8220;<p>I just want to thank you for providing a valuable service for nursing care. With so much of healthcare same day or short stay, it is nice to know there is ready access to skilled nursing care beyond the usual home care providers. I was especially happy I had a PACU (Recovery Room) nurse to attend me on my first post-surgical day home as I had no idea what to expect day two. Even though I am a nurse, I was unsure what level of discomfort I would experience after having a similar procedures in 1998. The peace of mind, knowing if I could not urinate, and needed catheterization or some other nursing intervention, I would not have to run to an ER in the middle of the night.</p>I could have found a nursing attendant to perform some tasks at less expense, but if I got into trouble, she could not have known what to do. She allowed me to rest most of the day, but I enjoyed her company even though I did not need many of her very extensive skills. It is nice to spend a day with such a fine professional and have the peace of mind we could deal with almost anything that might come my way AND my husband could go to work. Your follow-up before the procedure and after were much appreciated. Thanks again for everything! All the best to both of you.<p></p>&#8221;</p></p>", "patientFrom": "<b>G.P., Westchester, New York</b>"},
								{"testimonial": "<p>&#8220;<p>Having lost 160+ pounds following bariatric surgery 20 months ago, I opted for plastic surgery to remove the excess hanging skin that resulted from the weight loss. My plastic surgeon advised that a private nurse would be an additional safety factor for the first night of recovery and suggested we stay in a hotel near his offices on Park Avenue. He highly recommended Jill Tucker Nursing Service. My communications with Jill were detailed, and any questions or concerns were answered promptly. The nurse assigned to me was outstanding in every way: attentive, caring, communicative, knowledgeable. Her help was not only of a physical nature, but an emotional one so that my partner could enjoy a restful night's sleep and a decent meal while the nurse attended to me before she &#8220;took over&#8221; my post-surgical care the next day. My surgeon was right, and I echo his strong recommendation of Jill Tucker Nursing.</p>&#8221;</p></p>", "patientFrom": "<b>J.J.M., New York City</b>"},
								{"testimonial": "<p>&#8220;<p>I want to express my appreciation and gratitude for the care provided by the Registered Nurse arranged by Jill Tucker Nursing Services after my recent surgery. I am usually reticent to bestow accolades, but my admiration and respect for her make it easy to do.</p>Getting to know the nurse as she cared for me during the past few days gave me insight into the intelligence and enormous ability she has as a RN. She is an empathetic healer who consistently displays competent and trustworthy care. At the risk of using too many platitudes she is full of life and good humor and at the same time unpretentious and humble. Her demeanor reveals an extraordinarily brilliant and kind-hearted person.<p></p>In conclusion she is precisely the kind of caregiver and nurse any patient and family should welcome into their home. She is a thoughtful, proficient, and considerate professional who will bring peace of mind to any patient fortunate enough to be in her care.<p></p>&#8221;</p></p>", "patientFrom": "<b>N.S., Westchester, New York</b>"},
                {"testimonial": "<p>&#8220;<p>I have only wonderful things to say about my experience with Jill Tucker Nursing Services! I was facing outpatient surgery and did not have anyone locally available to escort me home after the surgery or to help provide aftercare. I reached out to Jill just a week beforehand and she was extremely responsive, getting back to me on the same day with a detailed plan for my care.</p><p>Just one day before the procedure I found out that my schedule had changed and Jill was able to seamlessly adjust, with my nurse meeting me at the hospital just after the procedure was completed. The aftercare that I received was excellent, the nurse was highly skilled and attentive and I felt confident that I was in good hands. Every aspect of my interaction with Jill Tucker Nursing Services was expertly handled and professional. I would recommend her services without reservation.</p>&#8221;</p></p>", "patientFrom": "<b>G.D., Jersey City, New Jersey</b>"},
								{"testimonial": "<p>&#8220;<p>Facing an involved shoulder surgery, not having any support and expressing anxiety about my post-op situation, my surgeon’s office recommended Jill Tucker Nursing Services.  Jill was an absolute boon to me.  Surgeons are not known to be the most communicative people in the medical profession and I had no idea what to expect despite internet research. Jill walked me through what to expect and need, days 1 through 3 and then days 4 through 7. She recommended an RN for the first few days followed by a certified nursing assistant. I was sure I did not need all of this care but Jill set it all up with the flexibility to adjust the care as I wished. She also made sure the care-givers would not be allergic to my cats. I couldn’t be more grateful for her being direct and honest and flexible.</p><p>Thanks to Jill, I felt fully armed with the necessary information and realistic expectations. I did indeed require the degree and extent of care she had recommended and the nursing care I received was respectful, caring, professional and competent. They were also very good company.  The care givers were on duty 24/7, which turned out to be imperative. I remain every grateful to Jill and her team for critical post-op care and transition to being able to look after myself.</p>&#8221;</p></p>", "patientFrom": "<b>A.L.B., Manhattan</b>"},
								{"testimonial": "<p>&#8220;<p>I have used Jill Tucker Nursing Services in both New York and in Washington, DC, each time with excellent results.</p><p>Jill Tucker is extremely nice to deal with. She is engaging and caring about the client's situation without being intrusive. She is very attentive to the individual physical needs of each patient. She exudes experience and knowledge of the nursing care milieu in both New York and Washington and is familiar with various physicians as well as hospitals, and their capabilities.</p><p>Jill is very organized in making the pick-up and delivery arrangements. She coordinates thoroughly with all concerned before the pick-up, calls early on to confirm with the client as well has her driver, and reconfirms closer to the date. Both nurse escorts Jill has selected for me have been polite and professional in their service. The nurse escort in New York was very kind, exactly on time, and took me quickly to my destination. The circumstances in Washington were a bit more complicated, because the escort had to drive and find the way into a large medical compound for the pickup. The nurse and the hospital staff coordinated closely on the pick-up time, and arrived exactly at the right place and the right time, with no wait required — a perfectly smooth transaction. Jill will also provide someone to care for the client after the surgery.</p><p>Knowing this reliable, efficient, and friendly service exists helps alleviate part of the anxiety of going for surgery. Not having the worry of transportation and post-op care provides an element of relief for the ordeal. Jill Tucker's service, at very reasonable rates, is a wonderful resource and one I sincerely endorse for anyone needing post-op nursing care.</p>&#8221;</p></p>", "patientFrom": "<b>T.T., McLean, Virginia</b>"}
            ]
		}
	]
}
